Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetPolyloop
Gets the planar polygon describing the opening geometry.
Remarks:
A planar polygon describing the surface geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Returns:
The planar polygon describing the opening geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalOpenings
Returns the analytical openings of the analytical surface.
Returns:
The collection of analytical openings.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAdjacentAnalyticalSpace
Gets the secondary adjacent analytical space this surface is associated with.
Remarks:
An exterior surface will only have one space adjacency.
Returns:
The secondary analytical space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalSpace
Gets the primary analytical space this surface is associated with.
Returns:
The primary analytical space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceId
The unique identifier for the surface.
Remarks:
This identification attribute is composed of the prefix "su"
and a sequential number, separated by "-". A sample value would
be "su-1".
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Corner
The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Remarks:
The analytical rectangular geometry is typically used in simulation engines.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Normal
The outward normal for this surface.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceType
The analytical surface type.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.OriginatingElementDescription
The description for the originating Revit element.
Remarks:
Surface and Opening elements get an originating element assigned
according to the below described schema, based on associative
room bounding element:
(Family Name): (Family Type)[Element Id] Sample:
Basic Wall: Cast Concrete Wall 12" [49749]
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.CADLinkUniqueId
The unique id of the originating CAD object's link (linked document) associated with this surface.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any link obtained through this method
may no longer be a valid or up-to-date link. The originating CAD link is only accurate and up-to-date at the time of creation of the energy model.
An empty string is returned if the originating CAD object is not hosted in a linked document.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this surface.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any element obtained through this method
may no longer be a valid or up-to-date model element. The originating CAD object is only accurate and up-to-date at the time of creation of the energy model.
If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceName
The unique name identifier for this surface.
Remarks:
Surface and Opening elements get an Name element assigned
according to the below described schema:
(Orientation)(Space#)[(Other space#)](Exposure)(Type)-(sequence number)[Opening Type+#]
Sample:
N-101-102-E-W-O-77
N = Orientation [N/NE/E/SE/S/SW/W/NW/N/T/B/X]
(every surface within the sector of 22.5 degrees from the north
vector gets the letter N etc) (horizontal surfaces facing upwards
get the letter T for top, downwards B for bottom) (shading surfaces
get the letter X for differentiation).
101 = Space number.
102 = Other space number.
E = Exposure - exterior/interior/underground [E/I/U].
W = Type [W/C/R/F] (Wall, Roof, Ceiling, Floor, Shade) (every
surface type has it's letter W-Wall R-Roof C-Ceiling F-Floor S-Shade).
O = Opening Type [W/D/O] (Window, Door, Opening) (every opening
type has it's letter W-Window D-Door O-Opening).
77 = sequence number.
Sample surface names:
N-101-E-W-84 North facing Exterior Wall #84 in space 101.
N-101-E-W-84-D-1 Door #1 in North facing Exterior Wall #84 in space 101.
E-101-102-I-W-92 Vertical Interior Wall #92 between space 101 and 102.
T-101-E-R-141 Top facing Exterior Roof #141 in space 101.
B-101-201-I-F-88 Bottom facing Interior Floor #88 between space 101 and 201.
X-73 Shade #73.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Type
The gbXML surface type attribute.
Remarks:
The type of surface is figured out depending on the source element and the number of space adjacencies.
If there is no associate source element and no space adjacencies, it will have a type of Shade. If there are any space adjacencies, it will have a type of Air. If the source element is a Wall or a Curtain Wall and have one space adjacency, it will have a type of ExteriorWall. If the source element is a Wall or a Curtain Wall and have two space adjacencies, it will have a type of InteriorWall. If the source element is a Wall or a Curtain Wall and the type Function parameter is set to "Interior" or "CoreShaft", it will have a type of InteriorWall. If the source element is a Wall or a Curtain Wall and have one space adjacency and if it is below grade, it will have a type of UndergroundWall. Note: If the top elevation of a surface is equal or below the elevation specified in Ground Plane, this surface is considered to below grade. If the source element is a Floor and have one space adjacency, it will have a type of SlabOnGrade. If the source element is above grade, it will have
a type of RaisedFloor. If the source element is below grade, it will have a type of UndergroundSlab. If the source element is a Floor and have two space adjacencies, it will have a type of InteriorFloor. If the source element is a Floor and the type Function parameter is set to "Interior", it will have a type of InteriorFloor. If the source element is a Roof or a Ceiling and have one space adjacency, it will have a type of Roof. If the source element is a Roof or a Ceiling and have one space adjacency and is below grade, it will have a type of UndergroundCeiling. If the source element is a Roof or a Ceiling and have two space adjacencies, it will have a type of Ceiling.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Tilt
The tilt angle for this surface.
Remarks:
The tilt is computed as the angle of rotation between
the outward normal of the surface and the Z-axis.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Azimuth
The azimuth angle for this surface.
Remarks:
The azimuth is computed as the angle of rotation between
the outward normal of the surface and the Y-axis (clockwise is positive).
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Height
The height of the analytical rectangular geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Width
The width of the analytical rectangular geometry.
Remarks:
The product of width and height should be equal to the area
of the polyloop for the opening. The width is adjusted to accomplish this.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
Analytical surface.
The collection of analytic openings belonging to this analytical parent surface
Since:
2012